Revit 2024 API
Rebar.IsHookLengthOverrideEnabled Method
 Returns True if the ability to override hook lengths is enabled for this rebar instance, False otherwise.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public bool IsHookLengthOverrideEnabled()
Visual Basic
Public Function IsHookLengthOverrideEnabled As Boolean
Visual C++
public:
bool IsHookLengthOverrideEnabled()
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace